// Задача №2
//  Console.Write("Введите первое число:");
// int a = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите второе число:");
// int b = Convert.ToInt32(Console.ReadLine());
//     if (a == b)
//         Console.WriteLine("Числа равны.");
//     if (a > b)
//         Console.WriteLine("Первое число является максимальным");
//     if (a < b)
//         Console.WriteLine("Второе число является максимальным");

// Задача №4
// Console.Write("Введите первое число:");
// int a = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите второе число:");
// int b = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите третье число:");
// int c = Convert.ToInt32(Console.ReadLine());
// int max = 0;
// max = a;
// if (b > a)
//     max = b;
// if (c > max)
//     max = c;
// Console.WriteLine(max);

// Задача №6
// Console.Write("Введите число:");
// int a = Convert.ToInt32(Console.ReadLine());
// if (a % 2==0)
//      Console.WriteLine("Число четное.");
// else
//     Console.WriteLine("Число нечетное.");


// Задача №8
// Console.Write("Введите число: ");
// int n = Convert.ToInt32(Console.ReadLine());

// for (int i = 1; i <= n; i++)
//    if (i % 2==0)
//     Console.Write(i + " ");